{
  "skill_id": "SCI001-03",
  "skill_name": "Energy",
  "subskills": [
    {
      "SUBSKILL_ID": "skill_id-E",
      "DESCRIPTION": "Sort common objects into groups based on whether they require energy to work (e.g., flashlight, toy car) or not (e.g., book, pencil)",
      "DIFFICULTY": "1-2-1"
    },
    {
      "SUBSKILL_ID": "skill_id-F",
      "DESCRIPTION": "Demonstrate how pushing and pulling objects requires different amounts of energy by comparing the force needed to move light vs. heavy objects",
      "DIFFICULTY": "2-3-2"
    },
    {
      "SUBSKILL_ID": "skill_id-G",
      "DESCRIPTION": "Create simple sound patterns by using different amounts of energy to strike objects (soft tap vs. hard tap)",
      "DIFFICULTY": "2-4-3"
    },
    {
      "SUBSKILL_ID": "skill_id-H",
      "DESCRIPTION": "Match energy sources (sun, batteries, electricity) to common devices or objects that use them",
      "DIFFICULTY": "3-4-3"
    },
    {
      "SUBSKILL_ID": "skill_id-I",
      "DESCRIPTION": "Observe and record how the sun's energy affects the temperature of different colored objects over time",
      "DIFFICULTY": "3-5-4"
    },
    {
      "SUBSKILL_ID": "skill_id-J",
      "DESCRIPTION": "Design a simple experiment to show how wind energy can move objects of different weights and sizes",
      "DIFFICULTY": "4-5-4"
    },
    {
      "SUBSKILL_ID": "skill_id-K",
      "DESCRIPTION": "Compare and contrast the amount of light energy that reaches different locations in the classroom using a simple light meter",
      "DIFFICULTY": "4-6-5"
    },
    {
      "SUBSKILL_ID": "skill_id-L",
      "DESCRIPTION": "Build a simple circuit using a battery, wires, and bulb to demonstrate electrical energy flow",
      "DIFFICULTY": "5-7-6"
    },
    {
      "SUBSKILL_ID": "skill_id-M",
      "DESCRIPTION": "Create a basic energy chain diagram showing how energy transforms from one form to another (e.g., battery → electrical → light)",
      "DIFFICULTY": "6-8-7"
    },
    {
      "SUBSKILL_ID": "skill_id-N",
      "DESCRIPTION": "Design and conduct an investigation to determine which materials best insulate against heat energy transfer",
      "DIFFICULTY": "7-9-8"
    }
  ]
}